app/views/posts/_post.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]
---

    <p class='text-muted'><%= pluralize(post.comments.count, 'Comentário') %></p>