app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC  [["post_id", 7]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]
SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = $1 LIMIT $2  [["post_id", 4], ["LIMIT", 1]]
---
    <h4>
      <%= pluralize(@post.comments.count, 'Comentário') %>

      <% if @post.comments.none? %>