app/controllers/comments_controller.rb

INSERT INTO "comments" ("post_id", "author", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["post_id", 4], ["author", "Tewste"], ["body", "teste"], ["created_at", "2023-08-29 00:07:48.414803"], ["updated_at", "2023-08-29 00:07:48.414803"]]
---
  def create
    comment = Comment.create!(comments_params)