app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def index
    @posts = Post.order(created_at: :desc)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC  [["post_id", 7]]
---
  def show
    @comments = @post.comments.order(created_at: :desc)

INSERT INTO "posts" ("title", "author", "body", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Terceiro post"], ["author", "Richa"], ["body", "Post do richa"], ["created_at", "2023-08-29 00:51:40.784028"], ["updated_at", "2023-08-29 00:51:40.784028"], ["slug", "terceiro-post"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save